#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

module.ec2["6-cd-pipeline"].data.aws_availability_zones.available: Reading...
module.ec2["6-cd-pipeline"].data.aws_ami.image: Reading...
data.aws_caller_identity.current: Reading...
module.vpc.data.aws_availability_zones.azs: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=326347646211]
module.ec2["6-cd-pipeline"].data.aws_availability_zones.available: Read complete after 1s [id=us-east-2]
module.vpc.data.aws_availability_zones.azs: Read complete after 1s [id=us-east-2]
module.ec2["6-cd-pipeline"].data.aws_ami.image: Read complete after 1s [id=ami-0862be96e41dcbf74]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_default_security_group.default-sg will be created
  + resource "aws_default_security_group" "default-sg" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3000
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "203.31.221.165/32",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_key_pair.ssh-key will be created
  + resource "aws_key_pair" "ssh-key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "devsecops-cicd-server-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCe8kt+wgxwbQcM6eMgaFILpgXkAxJhtgegUo57/ZXsNipaIzEFd596QZ2wg+g0TO0xtB2kwsCmX7IKINizc1D5DH/WSQOSpRmNf6jbNbQB6z+dm5ZlT5obxwnTseKbtg8oFudcTXrLapvS0sqbOq/BQ/aoeBB+oP+XYpoj3qQEOCHdcNHVkJNGoFh0RfUd36Bb4N3vr2wNivgug/W2j9XqP4APcJfN9ekKyGNPtSrx1JHUGIfgxexdijmkHPNpeyjNS5jF2RatMqOnLYKSRwrvJKUSoBpYASyRp2b4SKZHtH734fj4raryYJ2TFuYI+YdGnjA0dCYCr6tpf51RQ7YZ tonyrudny@Tonys-MacBook-Pro.local"
      + tags_all        = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
    }

  # module.ec2["6-cd-pipeline"].aws_instance.app will be created
  + resource "aws_instance" "app" {
      + ami                                  = "ami-0862be96e41dcbf74"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "us-east-2a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "app-server-role-tf"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "devsecops-cicd-server-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "6-cd-pipeline"
        }
      + tags_all                             = {
          + "Environment"      = "dev"
          + "Name"             = "6-cd-pipeline"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "07db727be885363e49cd9989eafb18822798c118"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = true
      + vpc_security_group_ids               = (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 8
          + volume_type           = (known after apply)
        }
    }

  # module.iam_role.aws_iam_instance_profile.app-server-role will be created
  + resource "aws_iam_instance_profile" "app-server-role" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "app-server-role-tf"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "app-server-role-tf"
      + tags_all    = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
      + unique_id   = (known after apply)
    }

  # module.iam_role.aws_iam_role.app-server-role will be created
  + resource "aws_iam_role" "app-server-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "app-server-role-tf"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
      + unique_id             = (known after apply)
    }

  # module.vpc.data.aws_subnets.private_subnets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnets" "private_subnets" {
      + id   = (known after apply)
      + ids  = (known after apply)
      + tags = (known after apply)

      + filter {
          + name   = "tag:Name"
          + values = [
              + "devsecops-cicd-private*",
            ]
        }
      + filter {
          + name   = "vpc-id"
          + values = [
              + (known after apply),
            ]
        }
    }

  # module.vpc.data.aws_subnets.public_subnets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnets" "public_subnets" {
      + id   = (known after apply)
      + ids  = (known after apply)
      + tags = (known after apply)

      + filter {
          + name   = "tag:Name"
          + values = [
              + "devsecops-cicd-public*",
            ]
        }
      + filter {
          + name   = "vpc-id"
          + values = [
              + (known after apply),
            ]
        }
    }

  # module.vpc.module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name"                                   = "devsecops-cicd-default"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
      + tags_all               = {
          + "Environment"                            = "dev"
          + "Name"                                   = "devsecops-cicd-default"
          + "Owner"                                  = "Terraform"
          + "ProvisionFromDir"                       = "live/dev"
          + "Repository"                             = "https://github.com/tonyrud/terraform-learn.git"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name"                                   = "devsecops-cicd-default"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
      + tags_all               = {
          + "Environment"                            = "dev"
          + "Name"                                   = "devsecops-cicd-default"
          + "Owner"                                  = "Terraform"
          + "ProvisionFromDir"                       = "live/dev"
          + "Repository"                             = "https://github.com/tonyrud/terraform-learn.git"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                                   = "devsecops-cicd-default"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
      + tags_all               = {
          + "Environment"                            = "dev"
          + "Name"                                   = "devsecops-cicd-default"
          + "Owner"                                  = "Terraform"
          + "ProvisionFromDir"                       = "live/dev"
          + "Repository"                             = "https://github.com/tonyrud/terraform-learn.git"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"                                   = "devsecops-cicd-us-east-2a"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
      + tags_all             = {
          + "Environment"                            = "dev"
          + "Name"                                   = "devsecops-cicd-us-east-2a"
          + "Owner"                                  = "Terraform"
          + "ProvisionFromDir"                       = "live/dev"
          + "Repository"                             = "https://github.com/tonyrud/terraform-learn.git"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"                                   = "devsecops-cicd"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
      + tags_all = {
          + "Environment"                            = "dev"
          + "Name"                                   = "devsecops-cicd"
          + "Owner"                                  = "Terraform"
          + "ProvisionFromDir"                       = "live/dev"
          + "Repository"                             = "https://github.com/tonyrud/terraform-learn.git"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"                                   = "devsecops-cicd-us-east-2a"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
      + tags_all                           = {
          + "Environment"                            = "dev"
          + "Name"                                   = "devsecops-cicd-us-east-2a"
          + "Owner"                                  = "Terraform"
          + "ProvisionFromDir"                       = "live/dev"
          + "Repository"                             = "https://github.com/tonyrud/terraform-learn.git"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                                   = "devsecops-cicd-private"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
      + tags_all         = {
          + "Environment"                            = "dev"
          + "Name"                                   = "devsecops-cicd-private"
          + "Owner"                                  = "Terraform"
          + "ProvisionFromDir"                       = "live/dev"
          + "Repository"                             = "https://github.com/tonyrud/terraform-learn.git"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                                   = "devsecops-cicd-public"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
      + tags_all         = {
          + "Environment"                            = "dev"
          + "Name"                                   = "devsecops-cicd-public"
          + "Owner"                                  = "Terraform"
          + "ProvisionFromDir"                       = "live/dev"
          + "Repository"                             = "https://github.com/tonyrud/terraform-learn.git"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                   = "devsecops-cicd-private-us-east-2a"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "kubernets.io/role/internal-elb"         = "1"
          + "terraform"                              = "true"
        }
      + tags_all                                       = {
          + "Environment"                            = "dev"
          + "Name"                                   = "devsecops-cicd-private-us-east-2a"
          + "Owner"                                  = "Terraform"
          + "ProvisionFromDir"                       = "live/dev"
          + "Repository"                             = "https://github.com/tonyrud/terraform-learn.git"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "kubernets.io/role/internal-elb"         = "1"
          + "terraform"                              = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                   = "devsecops-cicd-private-us-east-2b"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "kubernets.io/role/internal-elb"         = "1"
          + "terraform"                              = "true"
        }
      + tags_all                                       = {
          + "Environment"                            = "dev"
          + "Name"                                   = "devsecops-cicd-private-us-east-2b"
          + "Owner"                                  = "Terraform"
          + "ProvisionFromDir"                       = "live/dev"
          + "Repository"                             = "https://github.com/tonyrud/terraform-learn.git"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "kubernets.io/role/internal-elb"         = "1"
          + "terraform"                              = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                   = "devsecops-cicd-private-us-east-2c"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "kubernets.io/role/internal-elb"         = "1"
          + "terraform"                              = "true"
        }
      + tags_all                                       = {
          + "Environment"                            = "dev"
          + "Name"                                   = "devsecops-cicd-private-us-east-2c"
          + "Owner"                                  = "Terraform"
          + "ProvisionFromDir"                       = "live/dev"
          + "Repository"                             = "https://github.com/tonyrud/terraform-learn.git"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "kubernets.io/role/internal-elb"         = "1"
          + "terraform"                              = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                   = "devsecops-cicd-public-us-east-2a"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "kubernets.io/role/elb"                  = "1"
          + "terraform"                              = "true"
        }
      + tags_all                                       = {
          + "Environment"                            = "dev"
          + "Name"                                   = "devsecops-cicd-public-us-east-2a"
          + "Owner"                                  = "Terraform"
          + "ProvisionFromDir"                       = "live/dev"
          + "Repository"                             = "https://github.com/tonyrud/terraform-learn.git"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "kubernets.io/role/elb"                  = "1"
          + "terraform"                              = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                   = "devsecops-cicd-public-us-east-2b"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "kubernets.io/role/elb"                  = "1"
          + "terraform"                              = "true"
        }
      + tags_all                                       = {
          + "Environment"                            = "dev"
          + "Name"                                   = "devsecops-cicd-public-us-east-2b"
          + "Owner"                                  = "Terraform"
          + "ProvisionFromDir"                       = "live/dev"
          + "Repository"                             = "https://github.com/tonyrud/terraform-learn.git"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "kubernets.io/role/elb"                  = "1"
          + "terraform"                              = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                   = "devsecops-cicd-public-us-east-2c"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "kubernets.io/role/elb"                  = "1"
          + "terraform"                              = "true"
        }
      + tags_all                                       = {
          + "Environment"                            = "dev"
          + "Name"                                   = "devsecops-cicd-public-us-east-2c"
          + "Owner"                                  = "Terraform"
          + "ProvisionFromDir"                       = "live/dev"
          + "Repository"                             = "https://github.com/tonyrud/terraform-learn.git"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "kubernets.io/role/elb"                  = "1"
          + "terraform"                              = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"                                   = "devsecops-cicd"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
      + tags_all                             = {
          + "Environment"                            = "dev"
          + "Name"                                   = "devsecops-cicd"
          + "Owner"                                  = "Terraform"
          + "ProvisionFromDir"                       = "live/dev"
          + "Repository"                             = "https://github.com/tonyrud/terraform-learn.git"
          + "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
    }

Plan: 28 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ec2s   = [
      + {
          + name      = "6-cd-pipeline"
          + public_ip = (known after apply)
          + ssh       = (known after apply)
        },
    ]
  + vpc_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @tonyrud, Action: `pull_request`*